## Infrastructure Change Summary

#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation ✔️`success`
#### Plan 📖`success`
<details>

```terraform
[command]/home/runner/work/_temp/c8e4c002-c84c-475c-a23b-020885feda11/tofu-bin show -no-color plan
To view this run in a browser, visit:
https://app.terraform.io/app/HYTKY/do-tofu-test/runs/run-rc4HUHKgZxikw9K5

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # digitalocean_droplet.www-1 must be replaced
-/+ resource "digitalocean_droplet" "www-1" {
      ~ created_at           = "2024-05-15T19:47:03Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "419029859" -> (known after apply)
      ~ ipv4_address         = "46.101.218.118" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "www-1"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:419029859" -> (known after apply)
      ~ user_data            = "a2c2168ffa73270fa8481cf8ded8ef77d4a43647" -> "d9f84959c64c6cac22b0e96763d525d4611a1625" # forces replacement
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "665e6aa4-9da1-4f0d-a48b-900a3f0883e8" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ www-1_ipv4_address = "46.101.218.118" -> (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked
::debug::OpenTofu exited with code 0.
::debug::stdout: To view this run in a browser, visit:%0Ahttps://app.terraform.io/app/HYTKY/do-tofu-test/runs/run-rc4HUHKgZxikw9K5%0A%0AOpenTofu used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A-/+ destroy and then create replacement%0A%0AOpenTofu will perform the following actions:%0A%0A  # digitalocean_droplet.www-1 must be replaced%0A-/+ resource "digitalocean_droplet" "www-1" {%0A      ~ created_at           = "2024-05-15T19:47:03Z" -> (known after apply)%0A      ~ disk                 = 25 -> (known after apply)%0A      ~ id                   = "419029859" -> (known after apply)%0A      ~ ipv4_address         = "46.101.218.118" -> (known after apply)%0A      ~ ipv4_address_private = "10.114.0.2" -> (known after apply)%0A      + ipv6_address         = (known after apply)%0A      ~ locked               = false -> (known after apply)%0A      ~ memory               = 1024 -> (known after apply)%0A        name                 = "www-1"%0A      ~ price_hourly         = 0.00893 -> (known after apply)%0A      ~ price_monthly        = 6 -> (known after apply)%0A      ~ private_networking   = true -> (known after apply)%0A      ~ status               = "active" -> (known after apply)%0A      - tags                 = [] -> null%0A      ~ urn                  = "do:droplet:419029859" -> (known after apply)%0A      ~ user_data            = "a2c2168ffa73270fa8481cf8ded8ef77d4a43647" -> "d9f84959c64c6cac22b0e96763d525d4611a1625" # forces replacement%0A      ~ vcpus                = 1 -> (known after apply)%0A      ~ volume_ids           = [] -> (known after apply)%0A      ~ vpc_uuid             = "665e6aa4-9da1-4f0d-a48b-900a3f0883e8" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  ~ www-1_ipv4_address = "46.101.218.118" -> (known after apply)%0A%0ARun status: planned and saved (confirmable)%0AWorkspace is unlocked%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>
